/******************************************/
/*  整数比の直角三角形（相似チェックなし）*/
/******************************************/
#include <stdio.h>
void  main( )
 {
    int   a,a2,b,b2,c;

    pintf("\n＊＊整数比の直角三角形を探す＊＊\n");

    for( a=1; a<=100; a++ )
      {
        a2=a*a;
        do{
            b2=b*b;
            for( c=b+1; c<=100; c++ )
              {
                if ( a2+b2==c*c )
                  	{  printf("{\n}%d:%d:%d",a,b,c); }
              }
      	}while(1);
      }
 }